Revit 2024 API
BuiltInFailures.ElementFailures.FailedToRemoveElement Property
 Element cannot be removed from the solution. The solution is required to have at least two elements to be valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedToRemoveElement { get; }
Visual Basic
Public Shared ReadOnly Property FailedToRemoveElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedToRemoveElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElementFailures Class
Autodesk.Revit.DB Namespace